package week02.day6;

public class 배열3차원 {

	public static void main(String[] args) {
	 
		int[][][] 온도  = new int[3][2][7];
		// 첫번째 2차원배열 의미		
		온도[0][0][0] = 2;
		온도[0][0][1] = 2;
		온도[0][0][2] = 2;
		온도[0][0][3] = 2;
		온도[0][0][4] = 2;
		온도[0][0][5] = 2;
		온도[0][0][6] = 2;		

		온도[0][1][0] = 3;
		온도[0][1][1] = 3;
		온도[0][1][2] = 3;
		온도[0][1][3] = 3;
		온도[0][1][4] = 3;
		온도[0][1][5] = 3;
		온도[0][1][6] = 3;
		
		
		//두번째 2차원 배열을 표현
		
		온도[1][0][0] = 12;
		온도[1][0][1] = 12;
		온도[1][0][2] = 12;
		온도[1][0][3] = 12;
		온도[1][0][4] = 12;
		온도[1][0][5] = 12;
		온도[1][0][6] = 12;		

		온도[1][1][0] = 13;
		온도[1][1][1] = 13;
		온도[1][1][2] = 13;
		온도[1][1][3] = 13;
		온도[1][1][4] = 13;
		온도[1][1][5] = 13;
		온도[1][1][6] = 13; 
		
		//세번째 2차원 배열의 행, 열		
		온도[2][0][0] = 4;
		온도[2][0][1] = 4;
		온도[2][0][2] = 4;
		온도[2][0][3] = 4;
		온도[2][0][4] = 4;
		온도[2][0][5] = 4;
		온도[2][0][6] = 4;		

		온도[2][1][0] = 5;
		온도[2][1][1] = 5;
		온도[2][1][2] = 5;
		온도[2][1][3] = 5;
		온도[2][1][4] = 5;
		온도[2][1][5] = 5;
		온도[2][1][6] = 5;
		
		
		//3차원 배열은 면, 행, 열 정보를 알아야  값을 저장하고 읽어올수 있는 요소에 접근할 수 있다)
		for( int i=0; i< 3; i++) {	
			
			System.out.println("\n  Month");
			for( int j=0; j<2; j++) {				
				for( int k=0; k<7; k++) {
					  System.out.print( 온도[i][j][k]  + " ");
				}
				
				System.out.println( );
			}
			
			
		}
		
		
		
		
		
		
		
		
		

	}

}
