package week02.day6;

public class 배열2차원 {
	
	public static void main(String[] args) {
		
		// 1차원배열 
		
		int[][] 온도 = new int[2][7];   // 
	 
		
		//첫번째행 정보 
		온도[0][0]= -4;
		온도[0][1]= -3;
		온도[0][2]= 1;
		온도[0][3]= -2;
		온도[0][4]= -1;
		온도[0][5]= 0;
		온도[0][6]= 0;
		
		//두번째행 정보
		온도[1][0]=  2;
		온도[1][1]= 2;
		온도[1][2]= 1;
		온도[1][3]= -4;
		온도[1][4]= 0;
		온도[1][5]= 1;
		온도[1][6]= 2;
		
		
		//출력하기
		
		for( int i=0;  i<2 ; i++ ) {
			
			System.out.println( "\n" + i+1 + "주 온도:");
			for( int j=0 ; j<7; j++) {
			 	System.out.print(온도[i][j] +"  " );
			}		
			
		}
		 
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
